server/load-test.yml


config:
  target: "http://localhost:5000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Debug Login Test"
  processor: "./load-test-functions.js"

scenarios:
  - name: "Authenticate and Test API"
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "user@gmail.com"
            password: "123456789a"
          capture:
            json: "$.accessToken"
            as: "accessToken"
          afterResponse: "handleLoginResponse"
      - get:
          url: "/api/all-appointments"
          headers:
            Authorization: "Bearer {{ accessToken }}"